[
    {
        "title": "Boston Bluebikes Visualization",
        "year": "2025",
        "image": "https://marcushi66.github.io/personal-portfolio/images/project-bikewatching.png",
        "description": "An interactive Mapbox + D3 visualization showing real-time Bluebikes traffic across Boston. Features time filtering, traffic flow colors, and a custom legend.",
        "url": "https://marcushi66.github.io/bikewatching/"
    },
    {
        "title": "What Determines Victory in League of Legends?",
        "year": "2025",
        "image": "https://marcushi66.github.io/personal-portfolio/images/project-lol.png",
        "description": "An interactive D3-based explorable explanation analyzing early-game advantages in professional League of Legends. Features a clickable Rift map, dynamic win-rate visualizations, and a logistic regression simulator for predicting victory.",
        "url": "https://haoshuobi.github.io/dsc106-final-double-double/"
    },
    {
        "title": "Excepturi, deserunt ad. Iure.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Perferendis dolorum autem saepe eum itaque? Doloremque voluptate ea enim eaque aliquam nam nulla rerum dolore fugiat? Doloremque incidunt voluptas nobis, praesentium error dolorum nemo aspernatur explicabo qui sequi vel."
    },
    {
        "title": "Adipisci nam architecto alias?",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Iusto, veritatis! Autem cupiditate illum laborum, commodi amet, suscipit ducimus provident sapiente mollitia exercitationem dolorem, voluptatibus sequi voluptatem corporis temporibus accusamus reprehenderit minus adipisci explicabo natus maxime? Labore, quis quo!"
    },
    {
        "title": "Nemo libero reiciendis commodi?",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Libero vero, voluptatem esse magnam cumque ut asperiores itaque. Quisquam reprehenderit dolor fugit omnis molestiae, nihil id nostrum tempore quibusdam libero accusantium ullam exercitationem sunt quaerat consectetur voluptatum corporis consequuntur."
    },
    {
        "title": "Voluptas facilis maiores ab.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Cum fugit explicabo facere neque officiis. Quae repudiandae dolores repellat ea vel quis quos nihil velit, iure similique at quam excepturi dicta non provident sed possimus doloremque architecto. Nam, tempore."
    },
    {
        "title": "Quae rerum sunt necessitatibus.",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Accusamus pariatur architecto, sed officia dolore officiis odio praesentium velit. At veniam sequi labore voluptate, nihil expedita quod amet accusamus similique, hic molestias sit? Placeat nulla enim dolore optio aut?"
    },
    {
        "title": "Laboriosam iusto ratione voluptatem?",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Eius dignissimos consectetur ratione ullam, accusantium aperiam, itaque eum harum vel rerum odit cupiditate nam non corporis delectus blanditiis ex recusandae sed alias facere molestiae earum ipsum officiis quis! Molestiae."
    },
    {
        "title": "Vel alias unde facilis.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "In perspiciatis odit magni perferendis incidunt qui ratione dolorem. Sint laboriosam enim sunt ullam, eius praesentium quam cum reprehenderit fuga, esse, impedit fugit recusandae ducimus laudantium deserunt ab! Dolore, nemo!"
    },
    {
        "title": "Dolores, iste ut. Nemo!",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aperiam vitae perspiciatis excepturi rerum? Facilis unde quo commodi adipisci maiores temporibus quae accusamus dolore. Eum provident in facere! Dignissimos optio corrupti voluptate, maxime doloribus labore nostrum quis dolorum in?"
    },
    {
        "title": "Eos corrupti perspiciatis ipsa.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Repudiandae, quibusdam nostrum. Voluptas reprehenderit impedit veritatis delectus, accusamus sit quasi esse laboriosam doloremque consequuntur vel non, ratione deleniti asperiores quibusdam, facere voluptates natus? Quo atque sapiente quisquam mollitia ea."
    },
    {
        "title": "Fuga rem in labore!",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Ad nesciunt ipsam odio? Enim maxime et quod provident fugiat asperiores quidem aperiam voluptatibus numquam consequuntur deleniti cupiditate assumenda, nostrum laborum amet unde consectetur mollitia laboriosam! Dolorum expedita incidunt laborum."
    }
]